#9.5.2 读写CSV文件（一维二维多维数据）
#一维数据通常用列表、元组描述
lst1=['a','b','1',100]
tup1=(1,3,5,7,9)
print(lst1)
print(tup1)
#二维数据中每个数据项又是序列时，就构成了二维数据
#适合用CSV文件存储
lst2=[[1,2,3,4],['a','b','c'],[-9,-37,100]]
print(lst2[0][0:4])

#多维数据是二维数据的扩展，通过用列表或元组来组织，通过索引访问
tup2=(((1,2,3),(-1,-2,-3),('a','b','c')),((-100,-200),('ab','bc')))
print(tup2[1][0:2])
#键值对表示的高维数据成绩单，通过索引和键访问
dict={"成绩单":[
               {"姓名":"Rose","专业":"数学","score":"78"},
               {"姓名": "Mike","专业": "法学","score": "78"},
               {"姓名": "John","专业": "历史","score": "90"}
               ]
     }
print(dict["成绩单"][0]["姓名"])
print(dict["成绩单"][2]["score"])


